import pytest
from home_work_task_3_courses_list import analyze_courses

@pytest.mark.parametrize(
    "courses, mentors, durations, min_courses, min_duration, max_courses, max_duration",
    [
        (
            ["Java-разработчик с нуля", "Fullstack-разработчик на Python", "Python-разработчик с нуля", "Frontend-разработчик с нуля"],
            [
                ["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев",
                    "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
                ["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев",
                    "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
                ["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев", "Александр Бардин",
                    "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков", "Роман Гордиенко"],
                ["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
                    "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
            ],
            [14, 20, 12, 20],
            ['Python-разработчик с нуля'],
            12,
            ['Fullstack-разработчик на Python', 'Frontend-разработчик с нуля'],
            20
        ),
    ]
)
def test_analyze_courses(courses, mentors, durations, min_courses, min_duration, max_courses, max_duration):
    result = analyze_courses(courses, mentors, durations)
    
    for course in min_courses:
        assert course in result
    assert str(min_duration) in result

    for course in max_courses:
        assert course in result
    assert str(max_duration) in result
